//🛠 Проєкт: Drone Tactical Interface
// Легенда:
// Ти програмуєш бортовий комп'ютер дрона. Тобі потрібно обробити вхідні дані від сенсорів, розрахувати можливість атаки та сформувати звіт для оператора.
//
// Твоє завдання (покроковий алгоритм):
// Обробка вхідних даних (Error Handling & Spread):
// З сервера приходить рядок telemetryJSON. Спробуй розпарсити його (JSON.parse). Якщо дані пошкоджені, використовуй об'єкт з дефолтними налаштуваннями: { fuel: 50, distance: 0, status: 'manual' }. Об'єднай отримані дані з об'єктом droneSpecs (технічні характеристики), щоб отримати повну картину стану дрона.
//
// Розрахунок палива та енергії (Operators):
// У дрона є fuel (паливо). Кожна секунда польоту витрачає 1 одиницю. Використовуй декремент. Також розрахуй estimatedRange (прогноз дистанції): помнож залишок палива на коефіцієнт ефективності, але врахуй пріоритет операцій (спершу від палива відніми "резервний запас" у 5 одиниць, а потім множ).
//
// Система авторизації (Logical Operators):
// Створи логічну умову для активації зброї (canFire). Зброя активується, ТІЛЬКИ якщо:
//
// Користувач має права доступу (isAdmin).
//
// Дрон НЕ перебуває в режимі очікування (!isStandby).
//
// Рівень енергії більше 20% АБО активовано "Emergency Override".
//
// Генератор звітів (Functions & Strings):
// Напиши стрілочну функцію formatTargetLog. Вона має приймати назву цілі та відстань, а повертати гарно відформатований рядок через шаблонні рядки: [ЦІЛЬ: ИмяЦілі] - Відстань: Х метрів. Якщо назва цілі не передана, використовуй параметр за замовчуванням "Невідомий об'єкт".
//
// Фінальний вивід (Types & Logic):
// Перевір тип отриманого результату за допомогою typeof. Якщо це рядок — виведи його в консоль.


const droneSpecs = {
    model: "Specter-7",
    maxSpeed: 120
};

const telemetryJSON = '{"fuel" 85, "distance": 450, "status": "active"';

let isAdmin = true;
let isStandby = false;
let emergencyOverride = false;

//1
let telemetry;

try {
   telemetry = JSON.parse(telemetryJSON)
    console.log(telemetry)
} catch (error){
    console.error('Дані пошкоджено, використання дефолтних налаштувань!');

    telemetry = {
        fuel: 50,
        distance: 0,
        status: 'manual'
    };
    // console.log(telemetry)
}

let fullDroneStatus = {
    ...droneSpecs,
    ...telemetry
}
// console.log(fullDroneStatus)

//2

telemetry.fuel--
const efficiency = 2.5 // Це те, скільки метрів дрон пролітає на одній одиниці палива.
const landingSafetyMargin = 5 //Це недоторканний резерв на посадку

let estimatedRange = (telemetry.fuel - landingSafetyMargin) * efficiency

fullDroneStatus.estimatedRange = estimatedRange

// console.log(fullDroneStatus)

//3
function canFire(){
    if (isAdmin && !isStandby && (telemetry.fuel > 20 || emergencyOverride)){
        return true
    } else {
        return false
    }
}


//4
const formatTargetLog = (distance, targetName = 'Невідомий об\'єкт') => {
    return `ЦІЛЬ: ${targetName} - Відстань: ${distance} метрів.`;
}
//console.log(formatTargetLog(fullDroneStatus.estimatedRange))


//5
if (typeof formatTargetLog(fullDroneStatus.estimatedRange) === 'string'){
    console.log(formatTargetLog(fullDroneStatus.estimatedRange))
}

