//🚀 Завдання: Створення системи обробки замовлень

const rawOrders = [
    { id: 1, customer: "Олексій", items: ["Smartphone", "Case"], total: 500, status: "completed" },
    { id: 2, customer: "Марія", items: ["Laptop"], total: 1200, status: "pending" },
    { id: 3, customer: "Іван", items: ["Headphones", "Powerbank"], total: 150, status: "completed" },
    { id: 4, customer: "Олена", items: ["Watch"], total: 300, status: "cancelled" }
];

const shopInfo = {
    name: "TechStore",
    currency: "USD",
    location: { city: "Cherkasy", country: "Ukraine" }
};

//Крок 1: Деструктуризація налаштувань (Секція 16)
// Використовуючи деструктуризацію об'єкта shopInfo, витягни в окремі змінні:
// Назву магазину (name)
// Місто (city) — увага, це вкладений об'єкт!
// Створи повідомлення в консолі: "Вітаємо у [name], наше представництво у місті [city]!".

const {name,location:{city}} = shopInfo
console.log(`Вітаємо у ${name}, наше представництво у місті ${city}!`)

//Крок 2: Фільтрація та Масиви (Секція 15)
// Нам потрібні лише успішні замовлення для звіту.
// Використовуючи метод filter, створи новий масив completedOrders, куди потраплять лише ті замовлення, де status === "completed".

const completedOrders = rawOrders.filter(order => {
        return order.status === 'completed'
})
// console.log(completedOrders)

//Крок 3: Трансформація даних через map (Секція 15 + 16)
// Маркетологам потрібен список імен клієнтів, які зробили покупку.
// Створи масив customerNames. Використовуй map на масиві completedOrders.
// Важливо: Всередині map використай деструктуризацію, щоб одразу дістати customer з об'єкта замовлення.

const customerNames = completedOrders.map(names => names.customer)
//console.log(customerNames)

//Крок 4: Робота з елементами (Секція 15 + 10)
// Прийшло нове термінове замовлення!
// Створи об'єкт newOrder: { id: 5, customer: "Анна", items: ["Tablet"], total: 450, status: "pending" }.
// Додай його в початок масиву rawOrders (використовуй метод масивів).
// Виведи в консоль кількість товарів у Анни, звернувшись до масиву через індекс.

const newOrder = {
    id: 5,
    customer: "Анна",
    items: ["Tablet"],
    total: 450,
    status: "pending"
}

rawOrders.unshift(newOrder)
console.log(rawOrders[0].items.length)

//Крок 5: Безпечна обробка та функції (Секції 9, 12, 13)
// Напиши функцію getOrderBrief({ customer, total }).
// Функція приймає об'єкт замовлення (деструктуризація в параметрах).
// Використовуй оператор || (Short-circuiting), щоб якщо раптом імені немає, виводилося "Анонім".
// Поверни рядок: "Клієнт [customer] витратив [total] [валюта з shopInfo]".
// Бонус: Огорни виклик функції в try...catch.

try {
    function getOrderBrief ({customer, total}) {
        const name = customer || "Анонім";
        const { currency } = shopInfo;
        return `Клієнт ${name} витратив ${total} ${currency}`;
    }
    console.log(getOrderBrief(newOrder))
} catch (error) {
    console.log('Error')
}
