//🏋️ Міні-проєкт: “Фітнес-трекер користувачів”
//📌 Сценарій
// Ти розробляєш просту логіку для фітнес-платформи.
// У системі є користувачі, які тренуються, мають прогрес і різні статуси.
// Твоя програма повинна:
// Обробляти список користувачів
// Аналізувати їх активність
// Оновлювати статуси
// Формувати підсумковий звіт
// Визначати “активних” користувачів
// Коректно обробляти дані з сервера
// Все повинно бути пов’язано між собою:
// якщо ти змінюєш кількість тренувань — це впливає на статус, а статус впливає на фінальний звіт.



const users = [
    { id: 1, name: "Аліна", workouts: ["Cardio", "Yoga"], calories: 500, isActive: true },
    { id: 2, name: "Максим", workouts: ["Strength"], calories: 300, isActive: false },
    { id: 3, name: "Ірина", workouts: ["Cardio", "Strength", "Stretching"], calories: 800, isActive: true },
    { id: 4, name: "Денис", workouts: [], calories: 0, isActive: false }
]

const platformInfo = {
    name: "FitLife",
    maxCaloriesGoal: 700,
    location: {
        city: "Kyiv",
        country: "Ukraine"
    }
}

//🔹 КРОК 1. Аналіз активності (масиви)
// Відфільтруй користувачів, у яких isActive === true.
// Створи масив highPerformers — користувачі, у яких calories більше ніж maxCaloriesGoal.
// Для кожного користувача визнач:
// якщо workouts.length === 0 → він неактивний
// якщо тренувань більше 2 → познач його як “Pro User”
// 👉 Результат цього кроку впливає на статуси в наступному кроці.

const activeUsers = users.filter(({isActive}) => isActive ===true)
// console.log(activeUsers)
const highPerformers = users.filter(({calories}) => calories > platformInfo.maxCaloriesGoal)
// console.log(highPerformers)


const usersStatus = users.map(user => {
    let status = 'Regular User';
    let updatedIsActive = user.isActive;

    if(user.workouts.length === 0){
        updatedIsActive = false
        status = "Inactive";
    } else if(user.workouts.length > 2){
        status = 'Pro User'
    }

    return{ ...user,
        isActive: updatedIsActive,
        status}
})
// console.log(usersStatus)


//🔹 КРОК 2. Оновлення статусів (оператори + логіка)
// Якщо користувач має calories < 200, встанови isActive = false.
// Якщо calories > 1000, збільш його ціль maxCaloriesGoal на 10%.
// Якщо користувач не має тренувань — обнули його calories.
// 👉 Це змінює вихідні дані, які потім потраплять у фінальний звіт.

const statusUpdates = users.map(user => {
    let updatedIsActive = user.isActive;
    let updatedCalories = user.calories;
    let updatedMaxCaloriesGoal = platformInfo.maxCaloriesGoal;

    if(user.calories < 200){
        updatedIsActive = false
    }
    if(user.calories > 1000){
        updatedMaxCaloriesGoal *= 1.1
    }
    if(user.workouts.length === 0){
        updatedCalories = 0
    }

    return{
        ...user,
        isActive: updatedIsActive,
        calories: updatedCalories,
        updatedMaxCaloriesGoal

    }
})

console.log(statusUpdates)



// 🔹 КРОК 3. Деструктуризація
// Витягни з platformInfo:
// name
// city
// country
// Для кожного користувача у циклі деструктуризуй:
// name
// calories
// workouts
// Деструктуризуй перше тренування кожного користувача у змінну firstWorkout.
// 👉 Ці змінні використовуються у звіті.

const {name, location: {city, country}} = platformInfo

users.forEach( user => {
    const {name, calories, workouts} = user;
    const [firstWorkout] = workouts;
    console.log(name, calories, firstWorkout);
})




// 🔹 КРОК 4. Додавання нового користувача
// Додай нового користувача у масив.
// Потім створи новий масив копію користувачів через spread.
// У копії змінити ім’я одного користувача.
// 👉 Перевір, що оригінал не змінився.




// 🔹 КРОК 5. Формування підсумкового звіту (головний результат)
//
// Створи масив report, де кожен елемент — це рядок:
//
// Користувач [name] спалив [calories] калорій. Статус: Активний/Неактивний.
//
//
// Також додай:
//
// Загальну кількість користувачів
//
// Кількість активних
//
// Середню кількість калорій
//
// Список користувачів, які перевищили goal
//
// Це і є фінальний результат проекту.
//
// 🔹 КРОК 6. Логічні оператори
//
// Визнач, хто може отримати “Premium Badge”:
//
// Умова:
//
// (calories > 700 І isActive === true) АБО workouts.length > 3
//
//
// Створи окремий масив таких користувачів.
//
// 🔹 КРОК 7. Обробка JSON (імітація сервера)
//
// Імітуй отримання нового користувача у вигляді JSON-рядка.
//
// Спробуй розпарсити.
//
// Якщо помилка — виведи “Дані пошкоджені”.
//
// Якщо успішно — додай користувача у масив і перегенеруй звіт.