//🎮 Симуляція: «Конвертер валют»
// Напиши функцію convert(amount, currency), яка приймає суму та валюту (за замовчуванням 'USD') і повертає рядок: "Ви отримаєте [X] [валюта]".

function convert(amount, currency = 'USD') {
    console.log(`Ви отримаєте ${amount} ${currency}`)
}

convert(600)

//Just for fun
// 🏋️ Завдання: «Smart-конвертер 2.0»
// Тобі потрібно написати функцію smartConvert(amount, currency), де:
// Параметри: amount (сума) та currency (валюта, за замовчуванням 'USD').
// Логіка курсів:
// Якщо валюта 'USD', курс — 41.
// Якщо валюта 'EUR', курс — 45.
// Для всіх інших валют — курс 1 (просто повертаємо ту саму суму).
// Умова «Мінімальної суми»:
// Якщо підсумкова сума в гривнях менша за 100, функція має повернути рядок: "Сума занадто мала для обміну".
// Результат: Якщо сума достатня, функція має повернути (return) рядок: "За [Сума] [Валюта] ви отримаєте [Результат] грн".

function smartConvert(amount, currency = 'USD') {
    let rate

    if(currency === 'USD') {
        rate = 41
    } else if(currency === 'EUR'){
        rate = 45
    } else {
        rate = 1
    }
    const sumRate = amount * rate

    if(sumRate < 100) {
        console.log('Сума занадто мала для обміну')
        return
    }
    return(`За ${amount} ${currency} ви отримаєте ${sumRate} грн`)
}

console.log(smartConvert(30, 'EUR'))